app/controllers/home_controller.rb

  def send_line_notification
    if current_user.uid.present?
      User.all.each do |user|
---
SELECT "users".* FROM "users"