app/models/user.rb

  def self.from_omniauth(auth)
    # Try to find an existing user by the provider and UID
    user = find_by(provider: auth.provider, uid: auth.uid)

    unless user
      # If no user is found, create a new user.

      # Check if the LINE authentication provides an email. If not, create a placeholder email.
      email = auth.info.email.presence || "line_user_#{auth.uid}@example.com"

      # If the email already exists for another user, generate a new email by adding a random number.
      while exists?(email: email)
        email = "line_user_#{auth.uid}_#{rand(1000)}@example.com"
      end

      # Create a new user object using the data from the OmniAuth response.
      user = new(
        provider: auth.provider,
        uid: auth.uid,
        email: email,
        name: auth.info.name || "LineUser#{auth.uid}",
        image: auth.info.image,
        password: Devise.friendly_token[0, 20]
      )

      user.save!
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "provider", "uid", "name", "image") VALUES ('line_user_u435d1cf2b85dc22870da455f56ee2efd@example.com', '$2a$12$bjWyhzzAaPCQ2WhLJMRmTevbXpZ.0so8gmu3NUE8xnN8RT6LwFwVW', NULL, NULL, NULL, '2025-11-11 17:30:57.798110', '2025-11-11 17:30:57.798110', 'line', 'U435d1cf2b85dc22870da455f56ee2efd', 'KeVoDanh', 'https://profile.line-scdn.net/0hLEhjznCFE2pFEwwf8f5tFTVDEABmYkp4bn0JD3FGRAkvJF01OXYOX3cVHlModlFuOSYJCCUWGA5JAGQMW0XvXkIjTlt5KlE7bHZfjg') RETURNING "id"